src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Гиперссылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКниги</name>
    <type>
      <types>EnumRef.ТипКниги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Цены/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
// Удалить.
// 
// Параметры:
//  Книга - СправочникСсылка.Книги - Книга
//  ТипКниги - ПеречислениеСсылка.ТипКниги - Тип книги
//  Магазин - СправочникСсылка.Магазины - Магазин
Процедура Удалить(Книга, ТипКниги, Магазин) Экспорт
	
	Если ЗначениеЗаполнено(Книга) И ЗначениеЗаполнено(ТипКниги) И ЗначениеЗаполнено(Магазин) Тогда

		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Книга.Установить(Книга);
		НаборЗаписей.Отбор.ТипКниги.Установить(ТипКниги);
		НаборЗаписей.Отбор.Магазин.Установить(Магазин);
		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
